#+LaTeX_CLASS: djcb-org-article
#+TITLE: Consulting Services for Software Freedom Conservancy done in November 2013

* 2013-11-04
  CLOCK: [2013-11-04 Mon 15:00]--[2013-11-04 Mon 16:00] =>  1:00
  
* 2013-11-08
   CLOCK:[2013-11-08 Fri 16:00]--[2013-11-08 Fri 23:36] =>  7:36
** Published october's work description
** Wrote down ideas
** Wiki editing [Tryton#GeneratingReports]
*** Evaluating Tryton & Generating reports
* 2013-11-11
  :PROPERTIES:
  :ORDERED:  t
  :END:
** Tryton#GeneratingReports & FundAccounting
   CLOCK: [2013-11-11 Mon 16:53]--[2013-11-11 Mon 16:56] =>  0:03
   CLOCK: [2013-11-11 Mon 16:53]--[2013-11-11 Mon 16:53] =>  0:00
   CLOCK: [2013-11-11 Mon 16:39]--[2013-11-11 Mon 16:53] =>  0:14
   CLOCK: [2013-11-11 Mon 16:00]--[2013-11-11 Mon 16:31] =>  0:31
** Read: Fund Accounting & Generating reports
   CLOCK: [2013-11-11 Mon 19:48]--[2013-11-11 Mon 19:51] =>  0:03
   CLOCK: [2013-11-11 Mon 16:56]--[2013-11-11 Mon 16:57] =>  0:01
   CLOCK: [2013-11-11 Mon 16:31]--[2013-11-11 Mon 16:39] =>  0:08
** Switch to ii and irclog2html.py
   CLOCK: [2013-11-11 Mon 19:51]--[2013-11-11 Mon 19:56] =>  0:05
** Study Conservancy ledger setup, write use cases
   CLOCK: [2013-11-11 Mon 21:17]--[2013-11-11 Mon 21:19] =>  0:02
   CLOCK: [2013-11-11 Mon 19:56]--[2013-11-11 Mon 20:41] =>  0:45
** Switch IRC logging bot
   CLOCK: [2013-11-11 Mon 21:19]--[2013-11-11 Mon 22:12] =>  0:53
* 2013-11-12
  :PROPERTIES:
  :Effort:   3
  :END:

** Rehash evaluations

** Preliminary evaluations
*** Garradin
    CLOCK: [2013-11-12 Tue 18:42]--[2013-11-12 Tue 19:04] =>  0:22
*** Kuali
    CLOCK: [2013-11-12 Tue 19:45]--[2013-11-12 Tue 19:45] =>  0:00
    CLOCK: [2013-11-12 Tue 19:04]--[2013-11-12 Tue 19:25] =>  0:21
*** OpenPetra
    CLOCK: [2013-11-12 Tue 20:52]--[2013-11-12 Tue 21:23] =>  0:31
    CLOCK: [2013-11-12 Tue 20:05]--[2013-11-12 Tue 20:37] =>  0:32
    CLOCK: [2013-11-12 Tue 19:56]--[2013-11-12 Tue 19:57] =>  0:01
*** BeansBooks
    CLOCK: [2013-11-12 Tue 20:37]--[2013-11-12 Tue 20:41] =>  0:04
*** moneyGuru
    CLOCK: [2013-11-12 Tue 20:50]--[2013-11-12 Tue 20:52] =>  0:02
** Contstruct document with useful project information
   CLOCK: [2013-11-12 Tue 20:41]--[2013-11-12 Tue 20:50] =>  0:09

* 2013-11-13
** Evaluations
*** OpenPetra
    CLOCK: [2013-11-13 Wed 18:36]--[2013-11-13 Wed 21:21] =>  2:45
    CLOCK: [2013-11-13 Wed 17:21]--[2013-11-13 Wed 17:57] =>  0:36
    CLOCK: [2013-11-13 Wed 15:30]--[2013-11-13 Wed 17:21] =>  1:51
*** Apache OFBiz
    CLOCK: [2013-11-13 Wed 22:44]--[2013-11-13 Wed 23:00] =>  0:16
** Usecases
   CLOCK: [2013-11-13 Wed 21:51]--[2013-11-13 Wed 22:44] =>  0:53
   CLOCK: [2013-11-13 Wed 21:35]--[2013-11-13 Wed 21:49] =>  0:14

* 2013-11-14
  CLOCK: [2013-11-14 Thu 15:21]--[2013-11-14 Thu 15:25] =>  0:04
** Package VM with vagrant
   CLOCK: [2013-11-14 Thu 18:09]--[2013-11-14 Thu 18:22] =>  0:13
   CLOCK: [2013-11-14 Thu 15:25]--[2013-11-14 Thu 16:59] =>  1:34
** Set up Tryton in vagrant
   CLOCK: [2013-11-14 Thu 16:59]--[2013-11-14 Thu 18:09] =>  1:10
** Set up Frontaccounting in vagrant
   CLOCK: [2013-11-14 Thu 19:33]--[2013-11-14 Thu 21:32] =>  1:59
** UseCases
   CLOCK: [2013-11-14 Thu 22:14]--[2013-11-14 Thu 23:28] =>  1:14
   CLOCK: [2013-11-14 Thu 18:51]--[2013-11-14 Thu 19:33] =>  0:42
   CLOCK: [2013-11-14 Thu 18:45]--[2013-11-14 Thu 18:51] =>  0:06

* 2013-11-15
  CLOCK: [2013-11-15 Fri 22:48]--[2013-11-15 Fri 22:52] =>  0:04
  CLOCK: [2013-11-15 Fri 22:44]--[2013-11-15 Fri 22:48] =>  0:04
  CLOCK: [2013-11-15 Fri 14:49]--[2013-11-15 Fri 15:24] =>  0:35
** Evaluations
   CLOCK: [2013-11-15 Fri 22:02]--[2013-11-15 Fri 22:10] =>  0:08
   CLOCK: [2013-11-15 Fri 22:00]--[2013-11-15 Fri 22:02] =>  0:02
   CLOCK: [2013-11-15 Fri 17:04]--[2013-11-15 Fri 17:20] =>  0:16
*** GNUe
    CLOCK: [2013-11-15 Fri 16:11]--[2013-11-15 Fri 17:04] =>  0:53
    CLOCK: [2013-11-15 Fri 15:24]--[2013-11-15 Fri 15:45] =>  0:21
*** ERPNext
    CLOCK: [2013-11-15 Fri 20:51]--[2013-11-15 Fri 22:00] =>  1:09
    CLOCK: [2013-11-15 Fri 19:13]--[2013-11-15 Fri 19:46] =>  0:33
*** Kuali
    CLOCK: [2013-11-15 Fri 22:10]--[2013-11-15 Fri 22:44] =>  0:34

* 2013-11-18
** Evaluations
   CLOCK: [2013-11-18 Mon 17:30]--[2013-11-18 Mon 18:29] =>  0:59
   CLOCK: [2013-11-18 Mon 16:24]--[2013-11-18 Mon 16:29] =>  0:05
* 2013-11-19
** Workstation disk upgrade
   CLOCK: [2013-11-19 Wed 12:00]--[2013-11-19 Wed 14:00] =>  2:00
* 2013-11-20
** Evaluations
   CLOCK: [2013-11-20 Wed 21:23]--[2013-11-20 Wed 21:34] =>  0:11
   CLOCK: [2013-11-20 Wed 16:00]--[2013-11-20 Wed 16:08] =>  0:08
*** ERPNext
    CLOCK: [2013-11-20 Wed 19:37]--[2013-11-20 Wed 21:23] =>  1:46
    CLOCK: [2013-11-20 Wed 19:21]--[2013-11-20 Wed 19:31] =>  0:10
    CLOCK: [2013-11-20 Wed 17:45]--[2013-11-20 Wed 19:06] =>  1:21
    CLOCK: [2013-11-20 Wed 16:08]--[2013-11-20 Wed 16:28] =>  0:20
*** Bookyt
   CLOCK: [2013-11-20 Wed 22:09]--[2013-11-20 Wed 22:18] =>  0:09
   CLOCK: [2013-11-20 Wed 21:48]--[2013-11-20 Wed 22:09] =>  0:21

* 2013-11-21
** Reading Financial Basics for Nonprofit Managers
   CLOCK: [2013-11-21 Thu 20:10]--[2013-11-21 Thu 21:01] =>  0:51
   CLOCK: [2013-11-21 Thu 16:36]--[2013-11-21 Thu 17:42] =>  1:06
   CLOCK: [2013-11-21 Thu 15:08]--[2013-11-21 Thu 16:10] =>  1:02
* 2013-11-22
** Reading
   CLOCK: [2013-11-22 Fri 16:24]--[2013-11-22 Fri 17:38] =>  1:14
** Evaluations
   CLOCK: [2013-11-22 Fri 22:25]--[2013-11-22 Fri 22:57] =>  0:32
   CLOCK: [2013-11-22 Fri 20:51]--[2013-11-22 Fri 22:25] =>  1:34
   CLOCK: [2013-11-22 Fri 20:51]--[2013-11-22 Fri 22:00] =>  1:09
   CLOCK: [2013-11-22 Fri 19:17]--[2013-11-22 Fri 19:17] =>  0:00
   CLOCK: [2013-11-22 Fri 17:38]--[2013-11-22 Fri 18:21] =>  0:43
*** Kuali
    CLOCK: [2013-11-22 Fri 20:25]--[2013-11-22 Fri 20:51] =>  0:26
* 2013-11-25
** Accounting API
   CLOCK: [2013-11-25 Mon 21:58]--[2013-11-25 Mon 23:35] =>  1:37
** Evaluations
   CLOCK: [2013-11-25 Mon 21:49]--[2013-11-25 Mon 21:58] =>  0:09
   CLOCK: [2013-11-25 Mon 21:36]--[2013-11-25 Mon 21:49] =>  0:13
   CLOCK: [2013-11-25 Mon 15:07]--[2013-11-25 Mon 15:10] =>  0:03
*** OpenPetra
    CLOCK: [2013-11-25 Mon 20:53]--[2013-11-25 Mon 21:36] =>  0:43
    CLOCK: [2013-11-25 Mon 19:04]--[2013-11-25 Mon 19:57] =>  0:53
    CLOCK: [2013-11-25 Mon 18:48]--[2013-11-25 Mon 18:53] =>  0:05
    CLOCK: [2013-11-25 Mon 15:10]--[2013-11-25 Mon 15:11] =>  0:01
**** Installation
     CLOCK: [2013-11-25 Mon 18:04]--[2013-11-25 Mon 18:48] =>  0:44
     CLOCK: [2013-11-25 Mon 18:00]--[2013-11-25 Mon 18:04] =>  0:04
* 2013-11-26
** Accounting API
   CLOCK: [2013-11-26 Tue 16:56]--[2013-11-26 Tue 17:29] =>  0:33
** Evaluations
   CLOCK: [2013-11-26 Tue 20:46]--[2013-11-26 Tue 21:45] =>  0:59
   CLOCK: [2013-11-26 Tue 17:36]--[2013-11-26 Tue 18:34] =>  0:58

* 2013-11-27
** Evaluations
   CLOCK: [2013-11-27 Wed 19:00]--[2013-11-27 Wed 21:10] =>  2:10
   CLOCK: [2013-11-27 Wed 16:36]--[2013-11-27 Wed 17:16] =>  0:40
* Summary
#+BEGIN: clocktable :maxlevel 2 :emphasize nil :scope file
#+CAPTION: Clock summary at [2013-12-02 Mon 13:23]
| Headline                                     |      Time |      |
|----------------------------------------------+-----------+------|
| *Total time*                                 | *2d 9:38* |      |
|----------------------------------------------+-----------+------|
| 2013-11-04                                   |      1:00 |      |
| 2013-11-08                                   |      7:36 |      |
| 2013-11-11                                   |      2:45 |      |
| \__ Tryton#GeneratingReports &...            |           | 0:48 |
| \__ Read: Fund Accounting & Generating...    |           | 0:12 |
| \__ Switch to ii and irclog2html.py          |           | 0:05 |
| \__ Study Conservancy ledger setup, write... |           | 0:47 |
| \__ Switch IRC logging bot                   |           | 0:53 |
| 2013-11-12                                   |      2:02 |      |
| \__ Preliminary evaluations                  |           | 1:53 |
| \__ Contstruct document with useful...       |           | 0:09 |
| 2013-11-13                                   |      6:35 |      |
| \__ Evaluations                              |           | 5:28 |
| \__ Usecases                                 |           | 1:07 |
| 2013-11-14                                   |      7:02 |      |
| \__ Package VM with vagrant                  |           | 1:47 |
| \__ Set up Tryton in vagrant                 |           | 1:10 |
| \__ Set up Frontaccounting in vagrant        |           | 1:59 |
| \__ UseCases                                 |           | 2:02 |
| 2013-11-15                                   |      4:39 |      |
| \__ Evaluations                              |           | 3:56 |
| 2013-11-18                                   |      1:04 |      |
| \__ Evaluations                              |           | 1:04 |
| 2013-11-19                                   |      2:00 |      |
| \__ Workstation disk upgrade                 |           | 2:00 |
| 2013-11-20                                   |      4:26 |      |
| \__ Evaluations                              |           | 4:26 |
| 2013-11-21                                   |      2:59 |      |
| \__ Reading Financial Basics for...          |           | 2:59 |
| 2013-11-22                                   |      5:38 |      |
| \__ Reading                                  |           | 1:14 |
| \__ Evaluations                              |           | 4:24 |
| 2013-11-25                                   |      4:32 |      |
| \__ Accounting API                           |           | 1:37 |
| \__ Evaluations                              |           | 2:55 |
| 2013-11-26                                   |      2:30 |      |
| \__ Accounting API                           |           | 0:33 |
| \__ Evaluations                              |           | 1:57 |
| 2013-11-27                                   |      2:50 |      |
| \__ Evaluations                              |           | 2:50 |
#+END: clocktable
